{
  "dsNombre": "OBJECIONES_BOG_TRAINING_V1",
  "dsEntidadPropietaria": "Secretaría Distrital de Seguridad, Convivencia y Justicia",
  "dsAreaResponsable": "Dirección de Seguridad y Convivencia / Equipo de Analítica",
  "dsVersion": "1.0",
  "dsFechaCreacion": "2025-10-15",
  "dsFechaActualizacion": "2025-11-20",
  "dsContacto": "datos.seguridad@gobiernobogota.gov.co",
  "dsDescripcion": "Conjunto de datos histórico y enriquecido de objeciones a comparendos del CNSCC. Contiene textos de objeciones (escritos y transcritos), metadatos de localidad y la etiqueta de clasificación jurídica correcta. El dataset fue curado específicamente para entrenar modelos de NLP en español colombiano.",
  "dsFinalidad": "Entrenamiento, validación y prueba del modelo de clasificación automática de objeciones (NLP).",
  "dsProcesosServicios": "Servicio de Atención al Ciudadano - Trámite de Objeciones a Comparendos.",
  "dsFuente": "Sistema de Peticiones, Quejas, Reclamos y Sugerencias (PQRSD) - Histórico 3 años; Recolección en campo de objeciones verbales.",
  "dsMetodoCaptura": "Extracción SQL de base de datos PQRSD y transcripción manual de audios recolectados con consentimiento.",
  "dsFrecuenciaActualizacion": "Trimestral (para re-entrenamiento ante drift).",
  "dsNumeroRegistros": 5200,
  "dsNumeroVariables": 6,
  "dsTiposDatos": "Texto no estructurado (narrativa) y datos estructurados (categorías, localidad).",
  "dsRepresentatividadPoblacional": "Representativa de las 20 localidades de Bogotá. Se corrigió un desbalance inicial para asegurar representación de estratos 1, 2 y 3.",
  "dsDatosPersonales": "Datos personales directos eliminados. Se conservan rasgos lingüísticos y localidad aproximada.",
  "dsJustificacion": "Necesario para entrenar el algoritmo en el reconocimiento de patrones de lenguaje natural y jerga local.",
  "dsBaseLegal": "Ley 1581 de 2012 (Habeas Data) y Política de Gobierno Digital.",
  "dsDatosFaltantes": "0% en campos obligatorios (Texto y Etiqueta) tras limpieza. 5% en campo Localidad (imputado como 'Desconocido').",
  "dsInconsistencias": "Se eliminaron registros con textos menores a 5 palabras o ininteligibles.",
  "dsProcesosLimpieza": "De-identification (eliminación de nombres, cédulas, teléfonos con RegEx), normalización de texto (minúsculas, eliminación de caracteres especiales salvo puntuación crítica).",
  "dsControlesCalidad": "Revisión manual de una muestra del 10% por expertos legales para validar la etiqueta 'Ground Truth'.",
  "dsValidaciones": "Validación de longitud de texto, validación de consistencia entre tipo de infracción y texto.",
  "dsSesgosIdentificados": "Sesgo original: 68% de datos provenían de localidades de ingresos altos (Chapinero, Usaquén). Corregido mediante sobre-muestreo de Ciudad Bolívar y Bosa.",
  "dsDistribucionVariables": "Variable objetivo (Clase) balanceada. Variable 'Localidad' ajustada para reflejar demografía real de comparendos.",
  "dsRiesgosPoblacionesVulnerables": "Riesgo de menor precisión en textos con jerga muy específica o mala ortografía, lo que podría afectar a poblaciones con menor nivel educativo.",
  "dsLimitaciones": "No incluye objeciones en idiomas distintos al español. Dificultad con textos extremadamente largos (>500 palabras).",
  "dsNormalizacion": "Texto convertido a minúsculas, eliminación de emojis no relevantes.",
  "dsImputacion": "No se imputan textos. Si falta la etiqueta, el registro se descarta.",
  "dsBalanceo": "Técnicas de Oversampling para clases minoritarias y localidades subrepresentadas.",
  "dsAnonimizacion": "Técnica de supresión y generalización. Nombres propios reemplazados por token [NOMBRE].",
  "dsRiesgosDiscriminacion": "Posible discriminación por dialecto (sesgo lingüístico). Mitigado con Data Augmentation.",
  "dsRiesgosReidentificacion": "Bajo. Se eliminaron identificadores únicos. La combinación de texto + localidad tiene riesgo residual mínimo.",
  "dsRiesgosUsoIndebido": "Uso para perfilamiento socioeconómico o análisis de sentimiento político.",
  "dsRiesgosSesgosEstructurales": "El sistema legal base (CNSCC) puede tener sesgos en cómo se aplican los comparendos, lo cual se refleja en los datos.",
  "dsRiesgosVulneracionDerechos": "Monitoreo de métricas de equidad (Disparate Impact Ratio) para prevenir vulneración de igualdad.",
  "dsCumplimientoNormativo": "Cumple con principios de calidad y seguridad de la SIC.",
  "dsFinalidadAutorizada": "Exclusivamente para tareas de clasificación de objeciones y mejora del servicio al ciudadano.",
  "dsRestricciones": "Prohibido su uso para entrenamiento de modelos comerciales o vigilancia.",
  "dsUsosIndebidos": "Venta de datos a aseguradoras o burós de crédito.",
  "dsCondicionesAcceso": "Acceso restringido al equipo de Ciencia de Datos y Auditores.",
  "dsControlesSeguridad": "Almacenamiento en bucket S3 con cifrado SSE-S3. Acceso vía IAM Roles con MFA.",
  "dsCifrado": "AES-256 en reposo.",
  "dsCustodia": "Gerente de Tecnología (CIO).",
  "dsPoliticasAcceso": "Política de Mínimo Privilegio (PoLP).",
  "dsAprobacionEquipoDatos": "Aprobado - 2025-11-20",
  "dsAprobacionJuridica": "Aprobado - 2025-11-22",
  "dsAprobacionComiteIA": "Aprobado (Gate 4) - 2025-11-25",
  "tablaDiccionarioDatos": [
    {
      "Nombre variable": "id_registro",
      "Descripción": "Identificador único anonimizado del registro.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "UUID v4",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Generado aleatoriamente, sin relación con cédula."
    },
    {
      "Nombre variable": "texto_objecion",
      "Descripción": "Narrativa completa de la objeción presentada por el ciudadano.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Texto libre (max 2000 caracteres)",
      "¿Dato personal?": "si",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Sometido a proceso de limpieza de PII."
    },
    {
      "Nombre variable": "tipo_objecion_label",
      "Descripción": "Etiqueta de la clasificación jurídica correcta (Ground Truth).",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Procedimiento, Fondo, Notificación, Competencia",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Validada por expertos jurídicos."
    },
    {
      "Nombre variable": "localidad",
      "Descripción": "Localidad de Bogotá donde se impuso el comparendo.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Lista de 20 localidades (e.g., Suba, Kennedy)",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Utilizada como proxy para métricas de equidad socioeconómica."
    },
    {
      "Nombre variable": "origen_dato",
      "Descripción": "Fuente de donde proviene el registro.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "PQRSD_Historico, Transcripcion_Verbal, Data_Augmentation",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Para trazabilidad de calidad."
    }
  ],
  "tablaHistorialDataset": [
    {
      "Versión": "0.5",
      "Fecha": "2025-10-15",
      "Cambios realizados": "Versión inicial cruda extraída de PQRSD. Alto sesgo identificado.",
      "Responsable": "Ingeniero de Datos"
    },
    {
      "Versión": "0.8",
      "Fecha": "2025-11-05",
      "Cambios realizados": "Limpieza de PII y primera ronda de rebalanceo.",
      "Responsable": "Científico de Datos"
    },
    {
      "Versión": "1.0",
      "Fecha": "2025-11-20",
      "Cambios realizados": "Inclusión de transcripciones verbales y aprobación final de calidad para entrenamiento.",
      "Responsable": "Propietario de Datos"
    }
  ],
  "fechaExportacion": "2025-12-08T23:45:00-05:00",
  "versionDataSheet": "v1.0"
}