{
  "dsNombre": "OBJECIONES_BOG_TRAINING_V1",
  "dsEntidadPropietaria": "Secretaría Distrital de Seguridad, Convivencia y Justicia",
  "dsAreaResponsable": "Dirección de Seguridad y Convivencia",
  "dsVersion": "1.1",
  "dsFechaCreacion": "2025-08-01",
  "dsFechaActualizacion": "2025-10-15",
  "dsContacto": "datagov@seguridadbogota.gov.co",
  "dsDescripcion": "Historial anonimizado de objeciones a comparendos del Código Nacional de Seguridad y Convivencia Ciudadana (CNSCC) recibidas en Bogotá, utilizado para entrenar un modelo de NLP para clasificación automática.",
  "dsFinalidad": "Entrenar y mejorar el modelo de clasificación de objeciones y comprensión de lenguaje natural en el contexto de seguridad ciudadana.",
  "dsProcesosServicios": "Sistema Automatizado de Registro de Objeciones de Comparendos.",
  "dsFuente": "Sistema de Peticiones, Quejas, Reclamos y Sugerencias (PQRSD) y registros de objeciones presenciales y por escrito de los últimos 3 años.",
  "dsMetodoCaptura": "Extracción de registros históricos de bases de datos y transcripción de objeciones verbales (recolectadas con consentimiento informado).",
  "dsFrecuenciaActualizacion": "Re-entrenamiento trimestral con nuevos datos de objeciones procesadas.",
  "dsNumeroRegistros": 15200,
  "dsNumeroVariables": 4,
  "dsTiposDatos": "Texto, Categórico.",
  "dsRepresentatividadPoblacional": "Dataset rebalanceado para incluir una proporción representativa de objeciones de todas las 20 localidades de Bogotá, capturando diversidad socioeconómica y lingüística.",
  "dsDatosPersonales": "Originalmente contenía nombres, cédulas, direcciones. Tras la anonimización, no contiene datos personales identificables directamente. Se conservan metadatos agregados como la localidad.",
  "dsJustificacion": "El tratamiento es necesario para el cumplimiento de una función legal de la entidad (garantizar el debido proceso) y para mejorar un servicio público, bajo el principio de minimización.",
  "dsBaseLegal": "Ley 1581 de 2012 (Habeas Data), Ley 1712 de 2014 (Transparencia).",
  "dsDatosFaltantes": "Menos del 2% de los registros tienen campos de categoría de resolución vacíos. No se realiza imputación; se descartan para el entrenamiento supervisado.",
  "dsInconsistencias": "Errores ortográficos, uso de jerga, formatos de fecha inconsistentes. Corregidos mediante normalización de texto y scripts de limpieza.",
  "dsProcesosLimpieza": "Anonimización (de-identification), eliminación de duplicados, normalización de texto, corrección de errores ortográficos comunes, y rebalanceo de clases por localidad.",
  "dsControlesCalidad": "Validación cruzada por dos etiquetadores humanos en una muestra del 10% de los datos para asegurar consistencia en la categoría de resolución.",
  "dsValidaciones": "Scripts de Python para verificar la correcta anonimización y la distribución balanceada de datos por localidad.",
  "dsSesgosIdentificados": "Sesgo de representación inicial: 68% de los datos provenían de 3 localidades de estratos medio-altos (Chapinero, Usaquén, Suba), con lenguaje formal.",
  "dsDistribucionVariables": "La variable 'localidad' es clave para monitorear la equidad. Tras el rebalanceo, ninguna localidad tiene menos del 3% de representación en el dataset.",
  "dsRiesgosPoblacionesVulnerables": "Riesgo de que el modelo funcione peor para ciudadanos de localidades con menor representación inicial o con patrones de habla informal, afectando su acceso al trámite.",
  "dsLimitaciones": "El dataset no captura el tono emocional o el contexto no verbal de las objeciones verbales. La calidad de la transcripción puede variar.",
  "dsNormalizacion": "Textos convertidos a minúsculas, eliminación de stopwords, lematización y normalización de abreviaturas comunes.",
  "dsImputacion": "No se aplica. Registros con datos críticos faltantes son descartados.",
  "dsBalanceo": "Técnicas de sobremuestreo (oversampling) para las localidades subrepresentadas y submuestreo (undersampling) para las sobrerrepresentadas.",
  "dsAnonimizacion": "Técnicas de de-identification para eliminar nombres, números de cédula, direcciones exactas y cualquier otro dato que permita identificar directamente al ciudadano.",
  "dsRiesgosDiscriminacion": "Riesgo de discriminación indirecta si el modelo clasifica erróneamente objeciones de ciertos grupos demográficos debido a sesgos lingüísticos no mitigados.",
  "dsRiesgosReidentificacion": "Bajo. El riesgo de re-identificación a partir del texto anonimizado y la localidad es mínimo, pero no nulo. Se mitiga con controles de acceso estrictos.",
  "dsRiesgosUsoIndebido": "Riesgo de que los datos, incluso anonimizados, se usen para perfilar localidades o grupos demográficos para fines no autorizados.",
  "dsRiesgosSesgosEstructurales": "El dataset refleja sesgos estructurales existentes (ej. mayor número de comparendos en ciertas zonas), que deben ser considerados en la interpretación de los resultados del modelo.",
  "dsRiesgosVulneracionDerechos": "El principal riesgo es la vulneración del debido proceso si una objeción es mal clasificada. Se mitiga con la supervisión humana obligatoria.",
  "dsCumplimientoNormativo": "El DPO certifica que el tratamiento de datos anonimizados para entrenamiento cumple con la Ley 1581 de 2012 y la finalidad autorizada.",
  "dsFinalidadAutorizada": "Exclusivamente para entrenar y mejorar el modelo de clasificación de objeciones y comprensión de lenguaje natural en el contexto de seguridad ciudadana.",
  "dsRestricciones": "Acceso restringido al equipo de ciencia de datos del proyecto. Prohibida su copia o distribución fuera del entorno seguro de la entidad.",
  "dsUsosIndebidos": "Crear perfiles de 'ciudadanos objetores frecuentes' para vigilancia; predecir quién podría cometer infracciones futuras; compartir con otras entidades para fines distintos al servicio de objeciones.",
  "dsCondicionesAcceso": "Acceso mediante credenciales institucionales, con registro de auditoría de todas las consultas y usos.",
  "dsControlesSeguridad": "Almacenamiento en base de datos cifrada (AES-256), acceso a través de VPN, y monitoreo de anomalías en el acceso.",
  "dsCifrado": "Cifrado en reposo (AES-256) y en tránsito (TLS 1.3).",
  "dsCustodia": "El Propietario de Datos (Data Steward) de la Dirección de Seguridad y Convivencia es el custodio principal.",
  "dsPoliticasAcceso": "Política de Acceso a Datos Institucional (POL-DAT-002), que requiere justificación y aprobación para cualquier acceso.",
  "dsAprobacionEquipoDatos": "Aprobado. El equipo de datos certifica que el dataset está rebalanceado y es técnicamente apto para el entrenamiento.",
  "dsAprobacionJuridica": "Conforme. El uso para mejora del servicio está alineado con las funciones de la entidad.",
  "dsAprobacionComiteIA": "Aprobado con condición de equidad. No se autoriza el paso a Desarrollo hasta demostrar que el dataset es representativo de todas las localidades.",
  "tablaDiccionarioDatos": [
    {
      "Nombre variable": "tipo_infraccion",
      "Descripción": "Categoría de la infracción según el CNSCC.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Lista de códigos de infracción del CNSCC.",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Variable clave para la clasificación."
    },
    {
      "Nombre variable": "localidad",
      "Descripción": "Localidad de Bogotá donde ocurrieron los hechos.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Lista de las 20 localidades de Bogotá.",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Se usa como proxy para monitorear equidad."
    },
    {
      "Nombre variable": "texto_objecion_anonimizado",
      "Descripción": "Narrativa del ciudadano describiendo los motivos de la objeción, con datos personales eliminados.",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Texto libre.",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Principal insumo para el modelo de NLP."
    },
    {
      "Nombre variable": "categoria_resolucion",
      "Descripción": "Clasificación final de la objeción (etiqueta para entrenamiento).",
      "Tipo de dato": "texto",
      "Valores permitidos / rango": "Objeción por Procedimiento, por Fondo, por Competencia, etc.",
      "¿Dato personal?": "no",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Variable objetivo (target) para el modelo supervisado."
    }
  ],
  "tablaHistorialDataset": [
    {
      "Versión": "1.0",
      "Fecha": "2025-08-01",
      "Cambios realizados": "Creación inicial del dataset a partir de extracción de PQRSD. Se detecta sesgo de representación.",
      "Responsable": "Equipo de Datos"
    },
    {
      "Versión": "1.1",
      "Fecha": "2025-10-15",
      "Cambios realizados": "Rebalanceo del dataset para incluir muestras de todas las localidades y enriquecimiento con transcripciones de objeciones verbales.",
      "Responsable": "Equipo de Datos"
    }
  ],
  "fechaExportacion": "2025-11-20T10:00:00Z",
  "versionDataSheet": "1.1"
}