{
  "titulo": "Sistema de Asistencia para la Objeción de Comparendos de Tránsito",
  "entidad": "Secretaría de Movilidad del Distrito",
  "sponsor": "Director de Procesos Contravencionales",
  "responsable": "Líder de Innovación y Tecnología",
  "fecha": "01/03/2026 - v1.0",
  "problema": "El proceso de objeción de comparendos es manual, propenso a errores en la radicación y genera largos tiempos de espera para la primera respuesta. Muchos casos son rechazados por errores de forma y no de fondo.",
  "servicio": "Proceso de objeción de comparendos de tránsito",
  "proposito": "Guiar al ciudadano en la estructuración de su objeción y validar la completitud de la evidencia para reducir rechazos por forma y agilizar el proceso.",
  "tipo": "procesamiento",
  "resultados": "Reducción del 50% en el tiempo de primera respuesta, disminución del 30% en rechazos por falta de documentos, aumento de la satisfacción ciudadana.",
  "usuarios": "Ciudadanos que desean objetar un comparendo.",
  "perfil": "Heterogéneo, con posible estrés o urgencia por parte del ciudadano.",
  "propietario": "Dirección de Procesos Contravencionales",
  "stakeholders": "Inspectores de policía, abogados de la secretaría, equipo TIC, ciudadanos.",
  "rolesGobernanza": ["dpo", "tic", "juridica", "comite"],
  "fuentes": "Formulario web, documentos cargados por el ciudadano (PDFs, imágenes de pruebas).",
  "categoriasDatos": ["personales"],
  "volumen": "Estimación de 5,000 objeciones mensuales.",
  "calidad": "Variable, depende de la calidad de los documentos y la claridad de la narrativa del ciudadano.",
  "privacidad": "Incluye datos de identificación, placa del vehículo, detalles de la infracción.",
  "baseServicio": "Código Nacional de Tránsito (Ley 769 de 2002).",
  "baseLegal": ["funcion"],
  "normativa": "Ley 1581 de 2012 (Protección de Datos Personales).",
  "evaluacionLegal": "El sistema actúa como un asistente y no toma la decisión final, lo que es conforme a la ley. Requiere consentimiento informado.",
  "criteriosClasificacion": ["derechos", "decisiones"],
  "nivelRiesgo": "alto",
  "justificacion": "El sistema influye en el acceso a la justicia administrativa y el debido proceso. Un error podría llevar a un ciudadano a desistir de su derecho a objetar.",
  "riesgosEticos": "Riesgo de que el bot dé un mal consejo o no entienda un argumento válido, desincentivando la objeción.",
  "riesgosPrivacidad": "Fuga de información sobre infracciones y datos personales de los ciudadanos.",
  "riesgosSeguridad": "Manipulación de la evidencia cargada o ataques para saturar el sistema.",
  "riesgosEquidad": "El sistema podría no entender jergas o formas de expresión de ciertos grupos poblacionales, generando una barrera de acceso.",
  "riesgosOperativos": "Caída del sistema que impida radicar objeciones antes de la fecha límite.",
  "riesgosReputacionales": "Percepción de que la justicia es impartida por una 'máquina insensible'.",
  "mitigaciones": "Implementación de un flujo 'Human-in-the-loop' para casos complejos, auditorías de equidad, y canales claros para solicitar revisión humana.",
  "kpiTecnicos": "Precisión en la clasificación de tipo de prueba > 95%, Tasa de finalización del flujo > 80%.",
  "kpiImpacto": "Reducción del tiempo promedio de radicación, disminución de la tasa de rechazo por forma.",
  "kpiCumplimiento": "Cero incidentes de privacidad, auditorías de sesgo trimestrales.",
  "lineaBase": "Tiempo promedio de radicación manual: 25 minutos. Tasa de rechazo por forma: 40%.",
  "metas": "Reducir el tiempo de radicación a 10 minutos y la tasa de rechazo por forma al 10% en 12 meses.",
  "estrategia": "piloto",
  "alcance": "Piloto con las 3 infracciones más comunes. Escalamiento gradual al resto de infracciones.",
  "capacitacion": "Tutoriales interactivos para ciudadanos sobre cómo usar el bot y qué pruebas presentar.",
  "comunicacion": "Campaña informativa en el portal de la Secretaría de Movilidad y redes sociales.",
  "cronograma": "Mes 1-3: Desarrollo y entrenamiento. Mes 4: Piloto cerrado. Mes 5: Lanzamiento público.",
  "controles": "Monitoreo en tiempo real de la tasa de éxito y derivación a humanos.",
  "frecuencia": "Auditoría de equidad trimestral.",
  "protocolo": "Cualquier caso donde el bot tenga una confianza inferior al 85% se deriva a un agente humano.",
  "canales": "Botón de 'Hablar con un humano' siempre visible en la interfaz del chat.",
  "criterios": "Si la tasa de error en la clasificación de pruebas supera el 10% o si se detecta un sesgo significativo no mitigable.",
  "planDatos": "Eliminación segura de los documentos de prueba tras la resolución del caso, conservando metadatos anonimizados para estadística.",
  "planTransicion": "Reactivación del formulario web tradicional y refuerzo del equipo de validación manual.",
  "tecnica": "tecnicaViable",
  "juridica": "juridicaAjustes",
  "dpo": "dpoDpia",
  "planeacion": "planeacionGestion",
  "comite": "comiteCondiciones",
  "firma": "Aprobado para Fase 2 por el Comité de IA, sujeto a la presentación de un ARA/DPIA que detalle la mitigación de sesgos lingüísticos.",
  "fechaExportacion": "2026-02-15T10:00:00Z",
  "versionCanvas": "1.1"
}