{
  "dsNombre": "RESIDENCIA_BOG_VALIDATION_V1",
  "dsEntidadPropietaria": "Secretaría de Gobierno del Distrito Capital",
  "dsAreaResponsable": "Dirección de Atención al Ciudadano / Data Steward",
  "dsVersion": "1.0",
  "dsFechaCreacion": "2025-11-26",
  "dsFechaActualizacion": "2025-11-26",
  "dsContacto": "datagov@gobiernobogota.gov.co",
  "dsDescripcion": "Dataset compuesto por imágenes (PDF/JPG) de Cédulas de Ciudadanía y facturas de servicios públicos (Energía, Acueducto, Gas) para el trámite de Certificado de Residencia en Bogotá.",
  "dsFinalidad": "Entrenar y validar modelos de OCR/NLP para extraer y verificar automáticamente nombres, números de cédula, direcciones y fechas de recibos de servicios públicos.",
  "dsProcesosServicios": "Soporta el proceso automatizado de expedición del Certificado de Residencia.",
  "dsFuente": "Datos históricos de solicitudes previas anonimizadas y cargas controladas durante la fase piloto.",
  "dsMetodoCaptura": "Carga directa por el ciudadano a través del portal web del trámite.",
  "dsFrecuenciaActualizacion": "Según necesidad de re-entrenamiento (ej. por 'model drift').",
  "dsNumeroRegistros": 15000,
  "dsNumeroVariables": 4,
  "dsTiposDatos": "Imágenes (PDF/JPG), texto extraído.",
  "dsRepresentatividadPoblacional": "El dataset fue enriquecido para incluir muestras de facturas de todos los proveedores (Acueducto, Vanti, Enel) y fotografías de baja calidad para representar a ciudadanos con dispositivos de gama baja.",
  "dsDatosPersonales": "Nombres, apellidos, número de documento de identidad, dirección de residencia.",
  "dsJustificacion": "El tratamiento es necesario para la validación de identidad y residencia en un trámite administrativo solicitado por el titular del dato.",
  "dsBaseLegal": "Ejercicio de funciones públicas y simplificación de trámites (Ley 2052 de 2020).",
  "dsDatosFaltantes": "Menos del 2%. Se identifican datos faltantes en campos no estructurados de los recibos. La estrategia es derivar a revisión humana.",
  "dsInconsistencias": "Direcciones escritas con formatos no estándar (ej. 'Cll' vs 'Calle'). Se normalizan durante el pre-procesamiento.",
  "dsProcesosLimpieza": "Pre-procesamiento de imágenes para mejorar contraste y normalización de texto a formato estándar de la DIAN/Catastro antes de la validación.",
  "dsControlesCalidad": "Validación cruzada y etiquetado por doble entrada en la fase de curación de datos.",
  "dsValidaciones": "Scripts para verificar la consistencia de formatos de fecha y la estructura de las direcciones normalizadas.",
  "dsSesgosIdentificados": "Sesgo de representación inicial (80% facturas de Enel). Corregido al balancear el dataset con muestras de otros proveedores y formatos físicos.",
  "dsDistribucionVariables": "Distribución balanceada de proveedores de servicios y calidad de imagen (alta/media/baja).",
  "dsRiesgosPoblacionesVulnerables": "Riesgo de exclusión de ciudadanos con dispositivos de gama baja si el modelo no es robusto a imágenes de baja calidad. Mitigado con el enriquecimiento del dataset.",
  "dsLimitaciones": "El dataset no contiene ejemplos de documentos manuscritos o con un alto grado de deterioro, los cuales serán gestionados por el flujo de excepción humana.",
  "dsNormalizacion": "Normalización de direcciones a un formato estándar para facilitar la comparación.",
  "dsImputacion": "No se realiza imputación de datos. Los casos con datos faltantes o ilegibles se derivan a un agente humano.",
  "dsBalanceo": "Se aplicó sobremuestreo (oversampling) de imágenes de baja calidad y de proveedores de servicios con menor representación para evitar sesgos.",
  "dsAnonimizacion": "Los datos de entrenamiento se basan en solicitudes históricas anonimizadas. Los datos en producción se eliminan tras la validación.",
  "dsRiesgosDiscriminacion": "Riesgo de discriminación indirecta por brecha tecnológica. Se mitiga con pruebas de equidad y el protocolo 'Human-in-the-loop'.",
  "dsRiesgosReidentificacion": "Bajo. Los datos se usan en un entorno controlado y se eliminan post-trámite.",
  "dsRiesgosUsoIndebido": "Alto si no se controla. Se prohíbe explícitamente el uso de los datos para fines diferentes a la validación de residencia.",
  "dsRiesgosSesgosEstructurales": "El dataset puede reflejar sesgos socioeconómicos si la calidad de los documentos se correlaciona con el estrato. Se monitorea la tasa de error por estrato.",
  "dsRiesgosVulneracionDerechos": "El principal riesgo es la vulneración del derecho al debido proceso si hay un rechazo erróneo. Se mitiga con la intervención humana obligatoria para rechazos.",
  "dsCumplimientoNormativo": "El dataset y su tratamiento se alinean con la Ley 1581 de 2012 y la Circular 002 de la SIC.",
  "dsFinalidadAutorizada": "Exclusivamente para la validación de la coincidencia entre el solicitante y la dirección del predio para la expedición del certificado.",
  "dsRestricciones": "Acceso restringido al modelo de IA y a los auditores humanos autorizados.",
  "dsUsosIndebidos": "Prohibido usar los datos para evaluar capacidad de pago, crear mapas de morosidad o compartir con terceros comerciales.",
  "dsCondicionesAcceso": "Acceso mediante API Key con auditoría y solo desde la infraestructura del Distrito.",
  "dsControlesSeguridad": "Cifrado en tránsito (TLS 1.3) y en reposo (AES-256).",
  "dsCifrado": "Aplicado tanto en la base de datos de entrenamiento como en el almacenamiento temporal de producción.",
  "dsCustodia": "El Líder de Desarrollo e Innovación es el custodio técnico del dataset.",
  "dsPoliticasAcceso": "Política de Mínimo Privilegio. El acceso se concede por rol y se audita trimestralmente.",
  "dsAprobacionEquipoDatos": "Aprobado. El Data Steward certifica que el dataset ha sido balanceado y cumple con los requisitos de calidad.",
  "dsAprobacionJuridica": "Aprobado. El uso de los datos se enmarca en las funciones públicas de la entidad.",
  "dsAprobacionComiteIA": "Aprobado con la condición de demostrar estadísticamente que la diferencia de precisión entre formatos de alta y baja calidad es inferior al 5%.",
  "tablaDiccionarioDatos": [
    {
      "Nombre variable": "documento_identidad",
      "Descripción": "Imagen (PDF/JPG) de la Cédula de Ciudadanía o Extranjería.",
      "Tipo de dato": "imagen",
      "Valores permitidos / rango": "Formatos PDF, JPG, PNG.",
      "¿Dato personal?": "si",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Fuente principal para extraer nombre y número de ID."
    },
    {
      "Nombre variable": "recibo_servicio",
      "Descripción": "Imagen (PDF/JPG) del recibo de un servicio público domiciliario.",
      "Tipo de dato": "imagen",
      "Valores permitidos / rango": "Formatos PDF, JPG, PNG. Vigencia no mayor a 60 días.",
      "¿Dato personal?": "si",
      "¿Sensible?": "no",
      "Obligatorio": "si",
      "Observaciones": "Fuente para extraer dirección y verificar coincidencia."
    }
  ],
  "tablaHistorialDataset": [
    {
      "Versión": "1.0",
      "Fecha": "2025-11-26",
      "Cambios realizados": "Versión inicial. Se realizó un balanceo para incluir más muestras de recibos físicos y de proveedores distintos a Enel.",
      "Responsable": "Equipo de Datos / Data Steward"
    }
  ],
  "fechaExportacion": "2025-11-26T13:00:00Z",
  "versionDataSheet": "1.0"
}