{
  "titulo": "Sistema Automatizado de Validación y Expedición de Certificados de Residencia",
  "entidad": "Secretaría de Gobierno del Distrito Capital",
  "sponsor": "Director de Atención al Ciudadano / Product Owner",
  "responsable": "Líder de Desarrollo e Innovación / Equipo TIC",
  "fecha": "26/11/2025 - v1.0",
  "problema": "El proceso actual implica una validación manual de documentos que genera tiempos de espera de hasta 24 horas, depende de la capacidad humana limitada y horarios de oficina, y presenta riesgos de error en la subsanación que cierran el trámite injustificadamente.",
  "servicio": "Trámite de Expedición del Certificado de Residencia",
  "proposito": "Automatizar la clasificación y validación de documentos (Cédula y Recibos) mediante IA para emitir el certificado de forma inmediata y disponible 24/7.",
  "tipo": "procesamiento",
  "resultados": "Reducción del 95% en el tiempo de expedición (de 24h a minutos). Aumento del 23% en la satisfacción ciudadana (CSAT). Disponibilidad del servicio 24/7.",
  "usuarios": "Ciudadanos solicitantes del certificado (población general de Bogotá).",
  "perfil": "Heterogéneo, con niveles variados de alfabetización digital y acceso a dispositivos de diferente calidad (gama baja/alta).",
  "propietario": "Dirección de Atención al Ciudadano",
  "stakeholders": "Funcionarios de validación, equipo de TI, DPO (Oficial de Privacidad), ciudadanos.",
  "rolesGobernanza": ["dpo", "tic", "juridica", "comite"],
  "fuentes": "Imágenes o PDFs cargados por el ciudadano (Documento de Identidad, Recibo de Servicio Público).",
  "categoriasDatos": ["personales"],
  "volumen": "No especificado en el informe inicial.",
  "calidad": "Variable. Depende de la calidad de los documentos cargados por el ciudadano (fotos oscuras, escaneos malos).",
  "privacidad": "Incluye nombres, direcciones, número de documento de identidad.",
  "baseServicio": "Ejercicio de funciones públicas y simplificación de trámites.",
  "baseLegal": ["funcion"],
  "normativa": "Ley 1581 de 2012 (Habeas Data) y Circular 002 de la SIC.",
  "evaluacionLegal": "Viable bajo el estricto cumplimiento de la Ley 1581 y la Circular 002 de la SIC.",
  "criteriosClasificacion": ["derechos", "servicios", "decisiones"],
  "nivelRiesgo": "alto",
  "justificacion": "El sistema impacta el acceso a servicios esenciales, toma decisiones sobre personas y procesa datos personales masivamente.",
  "riesgosEticos": "No identificado explícitamente, pero relacionado con la equidad y la transparencia.",
  "riesgosPrivacidad": "Exposición de datos personales si la seguridad en el manejo de los archivos temporales (PDFs) es débil.",
  "riesgosSeguridad": "No especificado en el informe inicial.",
  "riesgosEquidad": "Sesgo técnico (OCR) que falle más con documentos de baja calidad, discriminando a ciudadanos con menor acceso a tecnología.",
  "riesgosOperativos": "Sobrecarga del personal humano si la tasa de derivación de casos es muy alta.",
  "riesgosReputacionales": "Percepción de que la entidad implementa un sistema que excluye a ciertos ciudadanos.",
  "mitigaciones": "Implementación de un flujo de 'Human-in-the-loop' para casos de baja confianza, no rechazando automáticamente.",
  "kpiTecnicos": "Precisión del Modelo (OCR/NLP) ≥ 98%, Tasa de Resolución Autónoma > 90%.",
  "kpiImpacto": "Tiempo Promedio de Expedición < 3 minutos, Satisfacción Ciudadana (CSAT) > 85%.",
  "kpiCumplimiento": "Diferencia de tasa de error entre documentos de alta y baja calidad < 5%.",
  "lineaBase": "Tiempo de expedición manual: hasta 24 horas.",
  "metas": "Reducir tiempo de expedición al 95% (minutos), aumentar CSAT en 23%.",
  "estrategia": "piloto",
  "alcance": "Piloto controlado seguido de despliegue general.",
  "capacitacion": "Capacitación a funcionarios para que pasen de validar todo a manejar solo excepciones.",
  "comunicacion": "Informar explícitamente al ciudadano que interactúa con una IA y su derecho a revisión humana.",
  "cronograma": "No especificado en el informe inicial.",
  "controles": "Tablero de control en tiempo real para monitorear KPIs.",
  "frecuencia": "Revisión trimestral de métricas de equidad y monitoreo de 'Drift'.",
  "protocolo": "Los casos que la IA no pueda validar con alta confianza (ej. <90% certeza) no serán rechazados, sino derivados a un funcionario humano.",
  "canales": "Opción para solicitar revisión humana en caso de inconformidad.",
  "criterios": "Si la tasa de error en poblaciones vulnerables supera los umbrales éticos o si cambios normativos prohíben la automatización.",
  "planDatos": "Eliminación segura o archivo de los datos conforme a la ley al final del ciclo de vida.",
  "planTransicion": "Reactivación del proceso manual o migración a un nuevo sistema.",
  "tecnica": "tecnicaViable",
  "juridica": "juridicaAjustes",
  "dpo": "dpoDpia",
  "planeacion": "planeacionGestion",
  "comite": "comiteCondiciones",
  "firma": "APROBADO PARA PASAR A FASE 2 (Clasificación y ARA/DPIA). Se condiciona el desarrollo a la presentación de un plan de mitigación de sesgos por calidad de imagen.",
  "fechaExportacion": "2025-11-26T09:00:00Z",
  "versionCanvas": "1.0"
}